Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.argocd.data.kubernetes_secret.argocd_initial_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "argocd_initial_password" {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-initial-admin-secret"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cloudflare.cloudflare_dns_record.istio-gateway will be updated in-place
~ resource "cloudflare_dns_record" "istio-gateway" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "34.47.92.167" -> (known after apply)
      ~ created_on          = "2025-01-28T12:03:24Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "5b3805bf479bd12a29aad2877a6cfdfa"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-01-28T12:03:24Z" -> (known after apply)
        name                = "*.goboolean.io"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.istio.data.kubernetes_service.istio_ingressgateway will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "istio_ingressgateway" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "istio-ingressgateway"
          + namespace        = "istio-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kafka.helm_release.kafka will be created
+ resource "helm_release" "kafka" {
      + atomic                     = false
      + chart                      = "kafka"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kafka"
      + namespace                  = "kafka"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + <<-EOT
                # Copyright Broadcom, Inc. All Rights Reserved.
                # SPDX-License-Identifier: APACHE-2.0
                
                ## @section Global parameters
                ## Global Docker image parameters
                ## Please, note that this will override the image parameters, including dependencies, configured to use the global value
                ## Current available global Docker image parameters: imageRegistry, imagePullSecrets and storageClass
                ##
                
                ## @param global.imageRegistry Global Docker image registry
                ## @param global.imagePullSecrets Global Docker registry secret names as an array
                ## @param global.defaultStorageClass Global default StorageClass for Persistent Volume(s)
                ## @param global.storageClass DEPRECATED: use global.defaultStorageClass instead
                ##
                global:
                  imageRegistry: ""
                  ## E.g.
                  ## imagePullSecrets:
                  ##   - myRegistryKeySecretName
                  ##
                  imagePullSecrets: []
                  defaultStorageClass: ""
                  storageClass: ""
                  ## Security parameters
                  ##
                  security:
                    ## @param global.security.allowInsecureImages Allows skipping image verification
                    allowInsecureImages: false
                  ## Compatibility adaptations for Kubernetes platforms
                  ##
                  compatibility:
                    ## Compatibility adaptations for Openshift
                    ##
                    openshift:
                      ## @param global.compatibility.openshift.adaptSecurityContext Adapt the securityContext sections of the deployment to make them compatible with Openshift restricted-v2 SCC: remove runAsUser, runAsGroup and fsGroup and let the platform use their allowed default IDs. Possible values: auto (apply if the detected running cluster is Openshift), force (perform the adaptation always), disabled (do not perform adaptation)
                      ##
                      adaptSecurityContext: auto
                ## @section Common parameters
                ##
                
                ## @param kubeVersion Override Kubernetes version
                ##
                kubeVersion: ""
                ## @param nameOverride String to partially override common.names.fullname
                ##
                nameOverride: ""
                ## @param fullnameOverride String to fully override common.names.fullname
                ##
                fullnameOverride: ""
                ## @param clusterDomain Default Kubernetes cluster domain
                ##
                clusterDomain: cluster.local
                ## @param commonLabels Labels to add to all deployed objects
                ##
                commonLabels: {}
                ## @param commonAnnotations Annotations to add to all deployed objects
                ##
                commonAnnotations: {}
                ## @param extraDeploy Array of extra objects to deploy with the release
                ##
                extraDeploy: []
                ## @param serviceBindings.enabled Create secret for service binding (Experimental)
                ## Ref: https://servicebinding.io/service-provider/
                ##
                serviceBindings:
                  enabled: false
                ## Enable diagnostic mode in the statefulset
                ##
                diagnosticMode:
                  ## @param diagnosticMode.enabled Enable diagnostic mode (all probes will be disabled and the command will be overridden)
                  ##
                  enabled: false
                  ## @param diagnosticMode.command Command to override all containers in the statefulset
                  ##
                  command:
                    - sleep
                  ## @param diagnosticMode.args Args to override all containers in the statefulset
                  ##
                  args:
                    - infinity
                ## @section Kafka parameters
                ##
                
                ## Bitnami Kafka image version
                ## ref: https://hub.docker.com/r/bitnami/kafka/tags/
                ## @param image.registry [default: REGISTRY_NAME] Kafka image registry
                ## @param image.repository [default: REPOSITORY_NAME/kafka] Kafka image repository
                ## @skip image.tag Kafka image tag (immutable tags are recommended)
                ## @param image.digest Kafka image digest in the way sha256:aa.... Please note this parameter, if set, will override the tag
                ## @param image.pullPolicy Kafka image pull policy
                ## @param image.pullSecrets Specify docker-registry secret names as an array
                ## @param image.debug Specify if debug values should be set
                ##
                image:
                  registry: docker.io
                  repository: bitnami/kafka
                  tag: 3.9.0-debian-12-r6
                  digest: ""
                  ## Specify a imagePullPolicy
                  ## ref: https://kubernetes.io/docs/concepts/containers/images/#pre-pulled-images
                  ##
                  pullPolicy: IfNotPresent
                  ## Optionally specify an array of imagePullSecrets.
                  ## Secrets must be manually created in the namespace.
                  ## ref: https://kubernetes.io/docs/tasks/configure-pod-container/pull-image-private-registry/
                  ## e.g:
                  ## pullSecrets:
                  ##   - myRegistryKeySecretName
                  ##
                  pullSecrets: []
                  ## Set to true if you would like to see extra information on logs
                  ##
                  debug: false
                ## @param extraInit Additional content for the kafka init script, rendered as a template.
                ##
                extraInit: ""
                ## @param config Configuration file for Kafka, rendered as a template. Auto-generated based on chart values when not specified.
                ## @param existingConfigmap ConfigMap with Kafka Configuration
                ## NOTE: This will override the configuration based on values, please act carefully
                ## If both are set, the existingConfigMap will be used.
                ##
                config: ""
                existingConfigmap: ""
                ## @param extraConfig Additional configuration to be appended at the end of the generated Kafka configuration file.
                ##
                extraConfig: ""
                ## @param extraConfigYaml Additional configuration in yaml format to be appended at the end of the generated Kafka configuration file.
                ##
                ## E.g.
                ## extraConfigYaml:
                ##   default.replication.factor: 3
                ##
                extraConfigYaml: {}
                ## @param secretConfig Additional configuration to be appended at the end of the generated Kafka configuration file.
                ## This value will be stored in a secret.
                ##
                secretConfig: ""
                ## @param existingSecretConfig Secret with additonal configuration that will be appended to the end of the generated Kafka configuration file
                ## The key for the configuration should be: server-secret.properties
                ## NOTE: This will override secretConfig value
                ##
                existingSecretConfig: ""
                ## @param log4j An optional log4j.properties file to overwrite the default of the Kafka brokers
                ## An optional log4j.properties file to overwrite the default of the Kafka brokers
                ## ref: https://github.com/apache/kafka/blob/trunk/config/log4j.properties
                ##
                log4j: ""
                ## @param existingLog4jConfigMap The name of an existing ConfigMap containing a log4j.properties file
                ## The name of an existing ConfigMap containing a log4j.properties file
                ## NOTE: this will override `log4j`
                ##
                existingLog4jConfigMap: ""
                ## @param heapOpts Kafka Java Heap configuration
                ##
                heapOpts: -XX:InitialRAMPercentage=75 -XX:MaxRAMPercentage=75
                ## @param brokerRackAssignment Set Broker Assignment for multi tenant environment Allowed values: `aws-az`, `azure`
                ## ref: https://cwiki.apache.org/confluence/display/KAFKA/KIP-392%3A+Allow+consumers+to+fetch+from+closest+replica
                ##
                brokerRackAssignment: ""
                ## @param brokerRackAssignmentApiVersion Set Broker Assignment API version when brokerRackAssignment set to : `azure`
                brokerRackAssignmentApiVersion: "2023-11-15"
                ## @param interBrokerProtocolVersion Override the setting 'inter.broker.protocol.version' during the ZK migration.
                ## Ref. https://docs.confluent.io/platform/current/installation/migrate-zk-kraft.html
                ##
                interBrokerProtocolVersion: ""
                ## Kafka listeners configuration
                ##
                listeners:
                  ## @param listeners.client.name Name for the Kafka client listener
                  ## @param listeners.client.containerPort Port for the Kafka client listener
                  ## @param listeners.client.protocol Security protocol for the Kafka client listener. Allowed values are 'PLAINTEXT', 'SASL_PLAINTEXT', 'SASL_SSL' and 'SSL'
                  ## @param listeners.client.sslClientAuth Optional. If SASL_SSL is enabled, configure mTLS TLS authentication type. If SSL protocol is enabled, overrides tls.authType for this listener. Allowed values are 'none', 'requested' and 'required'
                  client:
                    containerPort: 9092
                    protocol: PLAINTEXT
                    name: CLIENT
                    sslClientAuth: ""
                  ## @param listeners.controller.name Name for the Kafka controller listener
                  ## @param listeners.controller.containerPort Port for the Kafka controller listener
                  ## @param listeners.controller.protocol Security protocol for the Kafka controller listener. Allowed values are 'PLAINTEXT', 'SASL_PLAINTEXT', 'SASL_SSL' and 'SSL'
                  ## @param listeners.controller.sslClientAuth Optional. If SASL_SSL is enabled, configure mTLS TLS authentication type. If SSL protocol is enabled, overrides tls.authType for this listener. Allowed values are 'none', 'requested' and 'required'
                  ## Ref: https://cwiki.apache.org/confluence/display/KAFKA/KIP-684+-+Support+mutual+TLS+authentication+on+SASL_SSL+listeners
                  controller:
                    name: CONTROLLER
                    containerPort: 9093
                    protocol: PLAINTEXT
                    sslClientAuth: ""
                  ## @param listeners.interbroker.name Name for the Kafka inter-broker listener
                  ## @param listeners.interbroker.containerPort Port for the Kafka inter-broker listener
                  ## @param listeners.interbroker.protocol Security protocol for the Kafka inter-broker listener. Allowed values are 'PLAINTEXT', 'SASL_PLAINTEXT', 'SASL_SSL' and 'SSL'
                  ## @param listeners.interbroker.sslClientAuth Optional. If SASL_SSL is enabled, configure mTLS TLS authentication type. If SSL protocol is enabled, overrides tls.authType for this listener. Allowed values are 'none', 'requested' and 'required'
                  interbroker:
                    containerPort: 9094
                    protocol: SASL_PLAINTEXT
                    name: INTERNAL
                    sslClientAuth: ""
                  ## @param listeners.external.containerPort Port for the Kafka external listener
                  ## @param listeners.external.protocol Security protocol for the Kafka external listener. . Allowed values are 'PLAINTEXT', 'SASL_PLAINTEXT', 'SASL_SSL' and 'SSL'
                  ## @param listeners.external.name Name for the Kafka external listener
                  ## @param listeners.external.sslClientAuth Optional. If SASL_SSL is enabled, configure mTLS TLS authentication type. If SSL protocol is enabled, overrides tls.sslClientAuth for this listener. Allowed values are 'none', 'requested' and 'required'
                  external:
                    containerPort: 9095
                    protocol: SASL_PLAINTEXT
                    name: EXTERNAL
                    sslClientAuth: ""
                  ## @param listeners.extraListeners Array of listener objects to be appended to already existing listeners
                  ## E.g.
                  ## extraListeners:
                  ##  - name: CUSTOM
                  ##    containerPort: 9097
                  ##    protocol: SASL_PLAINTEXT
                  ##    sslClientAuth: ""
                  ##
                  extraListeners: []
                  ## NOTE: If set, below values will override configuration set using the above values (extraListeners.*, controller.*, interbroker.*, client.* and external.*)
                  ## @param listeners.overrideListeners Overrides the Kafka 'listeners' configuration setting.
                  ## @param listeners.advertisedListeners Overrides the Kafka 'advertised.listener' configuration setting.
                  ## @param listeners.securityProtocolMap Overrides the Kafka 'security.protocol.map' configuration setting.
                  overrideListeners: ""
                  advertisedListeners: ""
                  securityProtocolMap: ""
                ## @section Kafka SASL parameters
                ## Kafka SASL settings for authentication, required if SASL_PLAINTEXT or SASL_SSL listeners are configured
                ##
                sasl:
                  ## @param sasl.enabledMechanisms Comma-separated list of allowed SASL mechanisms when SASL listeners are configured. Allowed types: `PLAIN`, `SCRAM-SHA-256`, `SCRAM-SHA-512`, `OAUTHBEARER`
                  ## NOTE: At the moment, Kafka Raft mode does not support SCRAM, that is why only PLAIN is configured.
                  ##
                  enabledMechanisms: PLAIN,SCRAM-SHA-256,SCRAM-SHA-512
                  ## @param sasl.interBrokerMechanism SASL mechanism for inter broker communication.
                  ##
                  interBrokerMechanism: PLAIN
                  ## @param sasl.controllerMechanism SASL mechanism for controller communications.
                  ##
                  controllerMechanism: PLAIN
                  ## Settings for oauthbearer mechanism
                  ## @param sasl.oauthbearer.tokenEndpointUrl The URL for the OAuth/OIDC identity provider
                  ## @param sasl.oauthbearer.jwksEndpointUrl The OAuth/OIDC provider URL from which the provider's JWKS (JSON Web Key Set) can be retrieved
                  ## @param sasl.oauthbearer.expectedAudience The comma-delimited setting for the broker to use to verify that the JWT was issued for one of the expected audiences
                  ## @param sasl.oauthbearer.subClaimName The OAuth claim name for the subject.
                  ##
                  oauthbearer:
                    tokenEndpointUrl: ""
                    jwksEndpointUrl: ""
                    expectedAudience: ""
                    subClaimName: "sub"
                  ## Credentials for inter-broker communications.
                  ## @param sasl.interbroker.user Username for inter-broker communications when SASL is enabled
                  ## @param sasl.interbroker.password Password for inter-broker communications when SASL is enabled. If not set and SASL is enabled for the controller listener, a random password will be generated.
                  ## @param sasl.interbroker.clientId Client ID for inter-broker communications when SASL is enabled with mechanism OAUTHBEARER
                  ## @param sasl.interbroker.clientSecret Client Secret for inter-broker communications when SASL is enabled with mechanism OAUTHBEARER. If not set and SASL is enabled for the controller listener, a random secret will be generated.
                  ##
                  interbroker:
                    user: inter_broker_user
                    password: ""
                    clientId: inter_broker_client
                    clientSecret: ""
                  ## Credentials for controller communications.
                  ## @param sasl.controller.user Username for controller communications when SASL is enabled
                  ## @param sasl.controller.password Password for controller communications when SASL is enabled. If not set and SASL is enabled for the inter-broker listener, a random password will be generated.
                  ## @param sasl.controller.clientId Client ID for controller communications when SASL is enabled with mechanism OAUTHBEARER
                  ## @param sasl.controller.clientSecret Client Secret for controller communications when SASL is enabled with mechanism OAUTHBEARER. If not set and SASL is enabled for the inter-broker listener, a random secret will be generated.
                  ##
                  controller:
                    user: controller_user
                    password: ""
                    clientId: controller_broker_client
                    clientSecret: ""
                  ## Credentials for client communications.
                  ## @param sasl.client.users Comma-separated list of usernames for client communications when SASL is enabled
                  ## @param sasl.client.passwords Comma-separated list of passwords for client communications when SASL is enabled, must match the number of client.users
                  ##
                  client:
                    users:
                      - user1
                    passwords: ""
                  ## Credentials for Zookeeper communications.
                  ## @param sasl.zookeeper.user Username for zookeeper communications when SASL is enabled.
                  ## @param sasl.zookeeper.password Password for zookeeper communications when SASL is enabled.
                  ##
                  zookeeper:
                    user: ""
                    password: ""
                  ## @param sasl.existingSecret Name of the existing secret containing credentials for clientUsers, interBrokerUser, controllerUser and zookeeperUser
                  ## Create this secret running the command below where SECRET_NAME is the name of the secret you want to create:
                  ##       kubectl create secret generic SECRET_NAME --from-literal=client-passwords=CLIENT_PASSWORD1,CLIENT_PASSWORD2 --from-literal=inter-broker-password=INTER_BROKER_PASSWORD --from-literal=inter-broker-client-secret=INTER_BROKER_CLIENT_SECRET --from-literal=controller-password=CONTROLLER_PASSWORD --from-literal=controller-client-secret=CONTROLLER_CLIENT_SECRET --from-literal=zookeeper-password=ZOOKEEPER_PASSWORD
                  ## The client secrets are only required when using oauthbearer as sasl mechanism.
                  ## Client, interbroker and controller passwords are only required if the sasl mechanism includes something other than oauthbearer.
                  ##
                  existingSecret: ""
                ## @section Kafka TLS parameters
                ## Kafka TLS settings, required if SSL or SASL_SSL listeners are configured
                ##
                tls:
                  ## @param tls.type Format to use for TLS certificates. Allowed types: `JKS` and `PEM`
                  ##
                  type: JKS
                  ## @param tls.pemChainIncluded Flag to denote that the Certificate Authority (CA) certificates are bundled with the endpoint cert.
                  ## Certificates must be in proper order, where the top certificate is the leaf and the bottom certificate is the top-most intermediate CA.
                  ##
                  pemChainIncluded: false
                  ## @param tls.existingSecret Name of the existing secret containing the TLS certificates for the Kafka nodes.
                  ## When using 'jks' format for certificates, each secret should contain a truststore and a keystore.
                  ## Create these secrets following the steps below:
                  ## 1) Generate your truststore and keystore files. Helpful script: https://raw.githubusercontent.com/confluentinc/confluent-platform-security-tools/master/kafka-generate-ssl.sh
                  ## 2) Rename your truststore to `kafka.truststore.jks`.
                  ## 3) Rename your keystores to `kafka-<role>-X.keystore.jks` where X is the replica number of the .
                  ## 4) Run the command below one time per broker to create its associated secret (SECRET_NAME_X is the name of the secret you want to create):
                  ##      kubectl create secret generic SECRET_NAME_0 --from-file=kafka.truststore.jks=./kafka.truststore.jks \
                  ##        --from-file=kafka-controller-0.keystore.jks=./kafka-controller-0.keystore.jks --from-file=kafka-broker-0.keystore.jks=./kafka-broker-0.keystore.jks ...
                  ##
                  ## NOTE: Alternatively, a single keystore can be provided for all nodes under the key 'kafka.keystore.jks', this keystore will be used by all nodes unless overridden by the 'kafka-<role>-X.keystore.jks' file
                  ##
                  ## When using 'pem' format for certificates, each secret should contain a public CA certificate, a public certificate and one private key.
                  ## Create these secrets following the steps below:
                  ## 1) Create a certificate key and signing request per Kafka broker, and sign the signing request with your CA
                  ## 2) Rename your CA file to `kafka-ca.crt`.
                  ## 3) Rename your certificates to `kafka-X.tls.crt` where X is the ID of each Kafka broker.
                  ## 3) Rename your keys to `kafka-X.tls.key` where X is the ID of each Kafka broker.
                  ## 4) Run the command below one time per broker to create its associated secret (SECRET_NAME_X is the name of the secret you want to create):
                  ##      kubectl create secret generic SECRET_NAME_0 --from-file=kafka-ca.crt=./kafka-ca.crt --from-file=kafka-controller-0.crt=./kafka-controller-0.crt --from-file=kafka-controller-0.key=./kafka-controller-0.key \
                  ##        --from-file=kafka-broker-0.crt=./kafka-broker-0.crt --from-file=kafka-broker-0.key=./kafka-broker-0.key ...
                  ##
                  ## NOTE: Alternatively, a single key and certificate can be provided for all nodes under the keys 'kafka.crt' and 'kafka.key'. These certificates will be used by all nodes unless overridden by the 'kafka-<role>-X.key' and 'kafka-<role>-X.crt' files
                  ## NOTE: Alternatively, a single key and certificate can be provided for all nodes under the keys 'tls.crt' and 'tls.key'. These certificates will be used by all nodes unless overridden by the 'kafka-<role>-X.key' and 'kafka-<role>-X.crt' files
                  ##
                  existingSecret: ""
                  ## @param tls.autoGenerated Generate automatically self-signed TLS certificates for Kafka brokers. Currently only supported if `tls.type` is `PEM`
                  ## Note: ignored when using 'jks' format or `tls.existingSecret` is not empty
                  ##
                  autoGenerated: false
                  ## @param tls.customAltNames Optionally specify extra list of additional subject alternative names (SANs) for the automatically generated TLS certificates.
                  ##
                  customAltNames: []
                  ## @param tls.passwordsSecret Name of the secret containing the password to access the JKS files or PEM key when they are password-protected. (`key`: `password`)
                  ##
                  passwordsSecret: ""
                  ## @param tls.passwordsSecretKeystoreKey The secret key from the tls.passwordsSecret containing the password for the Keystore.
                  ##
                  passwordsSecretKeystoreKey: keystore-password
                  ## @param tls.passwordsSecretTruststoreKey The secret key from the tls.passwordsSecret containing the password for the Truststore.
                  ##
                  passwordsSecretTruststoreKey: truststore-password
                  ## @param tls.passwordsSecretPemPasswordKey The secret key from the tls.passwordsSecret containing the password for the PEM key inside 'tls.passwordsSecret'.
                  ##
                  passwordsSecretPemPasswordKey: ""
                  ## @param tls.keystorePassword Password to access the JKS keystore when it is password-protected. Ignored when 'tls.passwordsSecret' is provided.
                  ## When using tls.type=PEM, the generated keystore will use this password or randomly generate one.
                  ##
                  keystorePassword: ""
                  ## @param tls.truststorePassword Password to access the JKS truststore when it is password-protected. Ignored when 'tls.passwordsSecret' is provided.
                  ## When using tls.type=PEM, the generated keystore will use this password or randomly generate one.
                  ##
                  truststorePassword: ""
                  ## @param tls.keyPassword Password to access the PEM key when it is password-protected.
                  ## Note: ignored when using 'tls.passwordsSecret'
                  ##
                  keyPassword: ""
                  ## @param tls.jksKeystoreKey The secret key from the `tls.existingSecret` containing the keystore
                  ## Note: ignored when using 'pem' format for certificates.
                  ##
                  jksKeystoreKey: ""
                  ## @param tls.jksTruststoreSecret Name of the existing secret containing your truststore if truststore not existing or different from the one in the `tls.existingSecret`
                  ## Note: ignored when using 'pem' format for certificates.
                  ##
                  jksTruststoreSecret: ""
                  ## @param tls.jksTruststoreKey The secret key from the `tls.existingSecret` or `tls.jksTruststoreSecret` containing the truststore
                  ## Note: ignored when using 'pem' format for certificates.
                  ##
                  jksTruststoreKey: ""
                  ## @param tls.endpointIdentificationAlgorithm The endpoint identification algorithm to validate server hostname using server certificate
                  ## Disable server host name verification by setting it to an empty string.
                  ## ref: https://docs.confluent.io/current/kafka/authentication_ssl.html#optional-settings
                  ##
                  endpointIdentificationAlgorithm: https
                  ## @param tls.sslClientAuth Sets the default value for the ssl.client.auth Kafka setting.
                  ## ref: https://docs.confluent.io/current/kafka/authentication_ssl.html#optional-settings
                  ##
                  sslClientAuth: "required"
                  ## Zookeeper TLS connection configuration for Kafka
                  ##
                  zookeeper:
                    ## @param tls.zookeeper.enabled Enable TLS for Zookeeper client connections.
                    ##
                    enabled: false
                    ## @param tls.zookeeper.verifyHostname Hostname validation.
                    ##
                    verifyHostname: true
                    ## @param tls.zookeeper.existingSecret Name of the existing secret containing the TLS certificates for ZooKeeper client communications.
                    ##
                    existingSecret: ""
                    ## @param tls.zookeeper.existingSecretKeystoreKey The secret key from the  tls.zookeeper.existingSecret containing the Keystore.
                    ##
                    existingSecretKeystoreKey: zookeeper.keystore.jks
                    ## @param tls.zookeeper.existingSecretTruststoreKey The secret key from the tls.zookeeper.existingSecret containing the Truststore.
                    ##
                    existingSecretTruststoreKey: zookeeper.truststore.jks
                    ## @param tls.zookeeper.passwordsSecret Existing secret containing Keystore and Truststore passwords.
                    ##
                    passwordsSecret: ""
                    ## @param tls.zookeeper.passwordsSecretKeystoreKey The secret key from the tls.zookeeper.passwordsSecret containing the password for the Keystore.
                    ## If no keystore password is included in the passwords secret, set this value to an empty string.
                    ##
                    passwordsSecretKeystoreKey: keystore-password
                    ## @param tls.zookeeper.passwordsSecretTruststoreKey The secret key from the tls.zookeeper.passwordsSecret containing the password for the Truststore.
                    ## If no truststore password is included in the passwords secret, set this value to an empty string.
                    ##
                    passwordsSecretTruststoreKey: truststore-password
                    ## @param tls.zookeeper.keystorePassword Password to access the JKS keystore when it is password-protected. Ignored when 'tls.passwordsSecret' is provided.
                    ## When using tls.type=PEM, the generated keystore will use this password or randomly generate one.
                    ##
                    keystorePassword: ""
                    ## @param tls.zookeeper.truststorePassword Password to access the JKS truststore when it is password-protected. Ignored when 'tls.passwordsSecret' is provided.
                    ## When using tls.type=PEM, the generated keystore will use this password or randomly generate one.
                    ##
                    truststorePassword: ""
                ## @param extraEnvVars Extra environment variables to add to Kafka pods
                ## ref: https://github.com/bitnami/containers/tree/main/bitnami/kafka#configuration
                ## e.g:
                ## extraEnvVars:
                ##   - name: KAFKA_CFG_BACKGROUND_THREADS
                ##     value: "10"
                ##
                extraEnvVars: []
                ## @param extraEnvVarsCM ConfigMap with extra environment variables
                ##
                extraEnvVarsCM: ""
                ## @param extraEnvVarsSecret Secret with extra environment variables
                ##
                extraEnvVarsSecret: ""
                ## @param extraVolumes Optionally specify extra list of additional volumes for the Kafka pod(s)
                ## e.g:
                ## extraVolumes:
                ##   - name: kafka-jaas
                ##     secret:
                ##       secretName: kafka-jaas
                ##
                extraVolumes: []
                ## @param extraVolumeMounts Optionally specify extra list of additional volumeMounts for the Kafka container(s)
                ## extraVolumeMounts:
                ##   - name: kafka-jaas
                ##     mountPath: /bitnami/kafka/config/kafka_jaas.conf
                ##     subPath: kafka_jaas.conf
                ##
                extraVolumeMounts: []
                ## @param sidecars Add additional sidecar containers to the Kafka pod(s)
                ## e.g:
                ## sidecars:
                ##   - name: your-image-name
                ##     image: your-image
                ##     imagePullPolicy: Always
                ##     ports:
                ##       - name: portname
                ##         containerPort: 1234
                ##
                sidecars: []
                ## @param initContainers Add additional Add init containers to the Kafka pod(s)
                ## e.g:
                ## initContainers:
                ##   - name: your-image-name
                ##     image: your-image
                ##     imagePullPolicy: Always
                ##     ports:
                ##       - name: portname
                ##         containerPort: 1234
                ##
                initContainers: []
                ## DNS-Pod services
                ## Ref: https://kubernetes.io/docs/concepts/services-networking/dns-pod-service/
                ## @param dnsPolicy Specifies the DNS policy for the zookeeper pods
                ## DNS policies can be set on a per-Pod basis. Currently Kubernetes supports the following Pod-specific DNS policies.
                ## Available options: Default, ClusterFirst, ClusterFirstWithHostNet, None
                ## Ref: https://kubernetes.io/docs/concepts/services-networking/dns-pod-service/#pod-s-dns-policy
                dnsPolicy: ""
                ## @param dnsConfig  allows users more control on the DNS settings for a Pod. Required if `dnsPolicy` is set to `None`
                ## The dnsConfig field is optional and it can work with any dnsPolicy settings.
                ## Ref: https://kubernetes.io/docs/concepts/services-networking/dns-pod-service/#pod-dns-config
                ## E.g.
                ## dnsConfig:
                ##   nameservers:
                ##     - 192.0.2.1 # this is an example
                ##   searches:
                ##     - ns1.svc.cluster-domain.example
                ##     - my.dns.search.suffix
                ##   options:
                ##     - name: ndots
                ##       value: "2"
                ##     - name: edns0
                dnsConfig: {}
                ## @section Controller-eligible statefulset parameters
                ##
                controller:
                  ## @param controller.replicaCount Number of Kafka controller-eligible nodes
                  ## Ignore this section if running in Zookeeper mode.
                  ##
                  replicaCount: 0
                  ## @param controller.controllerOnly If set to true, controller nodes will be deployed as dedicated controllers, instead of controller+broker processes.
                  ##
                  controllerOnly: false
                  ## @param controller.minId Minimal node.id values for controller-eligible nodes. Do not change after first initialization.
                  ## Broker-only id increment their ID starting at this minimal value.
                  ## We recommend setting this this value high enough, as IDs under this value will be used by controller-elegible nodes
                  ##
                  minId: 0
                  ## @param controller.zookeeperMigrationMode Set to true to deploy cluster controller quorum
                  ## This allows configuring both kraft and zookeeper modes simultaneously in order to perform the migration of the Kafka metadata.
                  ## Ref. https://docs.confluent.io/platform/current/installation/migrate-zk-kraft.html
                  ##
                  zookeeperMigrationMode: false
                  ## @param controller.config Configuration file for Kafka controller-eligible nodes, rendered as a template. Auto-generated based on chart values when not specified.
                  ## @param controller.existingConfigmap ConfigMap with Kafka Configuration for controller-eligible nodes.
                  ## NOTE: This will override the configuration based on values, please act carefully
                  ## If both are set, the existingConfigMap will be used.
                  ##
                  config: ""
                  existingConfigmap: ""
                  ## @param controller.extraConfig Additional configuration to be appended at the end of the generated Kafka controller-eligible nodes configuration file.
                  ##
                  extraConfig: ""
                  ## @param controller.extraConfigYaml Additional configuration in yaml format to be appended at the end of the generated Kafka controller-eligible nodes configuration file.
                  ## If keys of extraConfigYaml are duplicated here, the value from controller.extraConfigYaml is taken.
                  ##
                  extraConfigYaml: {}
                  ## @param controller.secretConfig Additional configuration to be appended at the end of the generated Kafka controller-eligible nodes configuration file.
                  ## This value will be stored in a secret.
                  ##
                  secretConfig: ""
                  ## @param controller.existingSecretConfig Secret with additonal configuration that will be appended to the end of the generated Kafka controller-eligible nodes configuration file
                  ## The key for the configuration should be: server-secret.properties
                  ## NOTE: This will override controller.secretConfig value
                  ##
                  existingSecretConfig: ""
                  ## @param controller.heapOpts Kafka Java Heap size for controller-eligible nodes
                  ##
                  heapOpts: -Xmx1024m -Xms1024m
                  ## @param controller.command Override Kafka container command
                  ##
                  command: []
                  ## @param controller.args Override Kafka container arguments
                  ##
                  args: []
                  ## @param controller.extraEnvVars Extra environment variables to add to Kafka pods
                  ## ref: https://github.com/bitnami/containers/tree/main/bitnami/kafka#configuration
                  ## e.g:
                  ## extraEnvVars:
                  ##   - name: KAFKA_CFG_BACKGROUND_THREADS
                  ##     value: "10"
                  ##
                  extraEnvVars: []
                  ## @param controller.extraEnvVarsCM ConfigMap with extra environment variables
                  ##
                  extraEnvVarsCM: ""
                  ## @param controller.extraEnvVarsSecret Secret with extra environment variables
                  ##
                  extraEnvVarsSecret: ""
                  ## @param controller.extraContainerPorts Kafka controller-eligible extra containerPorts.
                  ##
                  extraContainerPorts: []
                  ## Configure extra options for Kafka containers' liveness, readiness and startup probes
                  ## ref: https://kubernetes.io/docs/tasks/configure-pod-container/configure-liveness-readiness-startup-probes/#configure-probes
                  ## @param controller.livenessProbe.enabled Enable livenessProbe on Kafka containers
                  ## @param controller.livenessProbe.initialDelaySeconds Initial delay seconds for livenessProbe
                  ## @param controller.livenessProbe.periodSeconds Period seconds for livenessProbe
                  ## @param controller.livenessProbe.timeoutSeconds Timeout seconds for livenessProbe
                  ## @param controller.livenessProbe.failureThreshold Failure threshold for livenessProbe
                  ## @param controller.livenessProbe.successThreshold Success threshold for livenessProbe
                  ##
                  livenessProbe:
                    enabled: true
                    initialDelaySeconds: 10
                    timeoutSeconds: 5
                    failureThreshold: 3
                    periodSeconds: 10
                    successThreshold: 1
                  ## @param controller.readinessProbe.enabled Enable readinessProbe on Kafka containers
                  ## @param controller.readinessProbe.initialDelaySeconds Initial delay seconds for readinessProbe
                  ## @param controller.readinessProbe.periodSeconds Period seconds for readinessProbe
                  ## @param controller.readinessProbe.timeoutSeconds Timeout seconds for readinessProbe
                  ## @param controller.readinessProbe.failureThreshold Failure threshold for readinessProbe
                  ## @param controller.readinessProbe.successThreshold Success threshold for readinessProbe
                  ##
                  readinessProbe:
                    enabled: true
                    initialDelaySeconds: 5
                    failureThreshold: 6
                    timeoutSeconds: 5
                    periodSeconds: 10
                    successThreshold: 1
                  ## @param controller.startupProbe.enabled Enable startupProbe on Kafka containers
                  ## @param controller.startupProbe.initialDelaySeconds Initial delay seconds for startupProbe
                  ## @param controller.startupProbe.periodSeconds Period seconds for startupProbe
                  ## @param controller.startupProbe.timeoutSeconds Timeout seconds for startupProbe
                  ## @param controller.startupProbe.failureThreshold Failure threshold for startupProbe
                  ## @param controller.startupProbe.successThreshold Success threshold for startupProbe
                  ##
                  startupProbe:
                    enabled: false
                    initialDelaySeconds: 30
                    periodSeconds: 10
                    timeoutSeconds: 1
                    failureThreshold: 15
                    successThreshold: 1
                  ## @param controller.customLivenessProbe Custom livenessProbe that overrides the default one
                  ##
                  customLivenessProbe: {}
                  ## @param controller.customReadinessProbe Custom readinessProbe that overrides the default one
                  ##
                  customReadinessProbe: {}
                  ## @param controller.customStartupProbe Custom startupProbe that overrides the default one
                  ##
                  customStartupProbe: {}
                  ## @param controller.lifecycleHooks lifecycleHooks for the Kafka container to automate configuration before or after startup
                  ##
                  lifecycleHooks: {}
                  ## Kafka init container resource requests and limits
                  ## ref: https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
                  ## @param controller.initContainerResources.limits The resources limits for the init container
                  ## @param controller.initContainerResources.requests The requested resources for the init container
                  ##
                  initContainerResources:
                    limits: {}
                    requests: {}
                  ## Kafka resource requests and limits
                  ## ref: https://kubernetes.io/docs/concepts/configuration/manage-compute-resources-container/
                  ## @param controller.resourcesPreset Set container resources according to one common preset (allowed values: none, nano, micro, small, medium, large, xlarge, 2xlarge). This is ignored if controller.resources is set (controller.resources is recommended for production).
                  ## More information: https://github.com/bitnami/charts/blob/main/bitnami/common/templates/_resources.tpl#L15
                  ##
                  resourcesPreset: "small"
                  ## @param controller.resources Set container requests and limits for different resources like CPU or memory (essential for production workloads)
                  ## Example:
                  ## resources:
                  ##   requests:
                  ##     cpu: 2
                  ##     memory: 512Mi
                  ##   limits:
                  ##     cpu: 3
                  ##     memory: 1024Mi
                  ##
                  resources: {}
                  ## Kafka pods' Security Context
                  ## ref: https://kubernetes.io/docs/tasks/configure-pod-container/security-context/#set-the-security-context-for-a-pod
                  ## @param controller.podSecurityContext.enabled Enable security context for the pods
                  ## @param controller.podSecurityContext.fsGroupChangePolicy Set filesystem group change policy
                  ## @param controller.podSecurityContext.sysctls Set kernel settings using the sysctl interface
                  ## @param controller.podSecurityContext.supplementalGroups Set filesystem extra groups
                  ## @param controller.podSecurityContext.fsGroup Set Kafka pod's Security Context fsGroup
                  ## @param controller.podSecurityContext.seccompProfile.type Set Kafka pods's Security Context seccomp profile
                  ##
                  podSecurityContext:
                    enabled: true
                    fsGroupChangePolicy: Always
                    sysctls: []
                    supplementalGroups: []
                    fsGroup: 1001
                    seccompProfile:
                      type: "RuntimeDefault"
                  ## Kafka containers' Security Context
                  ## ref: https://kubernetes.io/docs/tasks/configure-pod-container/security-context/#set-the-security-context-for-a-container
                  ## @param controller.containerSecurityContext.enabled Enable Kafka containers' Security Context
                  ## @param controller.containerSecurityContext.seLinuxOptions [object,nullable] Set SELinux options in container
                  ## @param controller.containerSecurityContext.runAsUser Set containers' Security Context runAsUser
                  ## @param controller.containerSecurityContext.runAsGroup Set containers' Security Context runAsGroup
                  ## @param controller.containerSecurityContext.runAsGroup Set Kafka containers' Security Context runAsGroup
                  ## @param controller.containerSecurityContext.runAsNonRoot Set Kafka containers' Security Context runAsNonRoot
                  ## @param controller.containerSecurityContext.allowPrivilegeEscalation Force the child process to be run as non-privileged
                  ## @param controller.containerSecurityContext.readOnlyRootFilesystem Allows the pod to mount the RootFS as ReadOnly only
                  ## @param controller.containerSecurityContext.capabilities.drop Set Kafka containers' server Security Context capabilities to be dropped
                  ## e.g:
                  ##   containerSecurityContext:
                  ##     enabled: true
                  ##     capabilities:
                  ##       drop: ["NET_RAW"]
                  ##     readOnlyRootFilesystem: true
                  ##
                  containerSecurityContext:
                    enabled: true
                    seLinuxOptions: {}
                    runAsUser: 1001
                    runAsGroup: 1001
                    runAsNonRoot: true
                    allowPrivilegeEscalation: false
                    readOnlyRootFilesystem: true
                    capabilities:
                      drop: ["ALL"]
                  ## @param controller.automountServiceAccountToken Mount Service Account token in pod
                  ##
                  automountServiceAccountToken: false
                  ## @param controller.hostAliases Kafka pods host aliases
                  ## https://kubernetes.io/docs/concepts/services-networking/add-entries-to-pod-etc-hosts-with-host-aliases/
                  ##
                  hostAliases: []
                  ## @param controller.hostNetwork Specify if host network should be enabled for Kafka pods
                  ##
                  hostNetwork: false
                  ## @param controller.hostIPC Specify if host IPC should be enabled for Kafka pods
                  ##
                  hostIPC: false
                  ## @param controller.podLabels Extra labels for Kafka pods
                  ## Ref: https://kubernetes.io/docs/concepts/overview/working-with-objects/labels/
                  ##
                  podLabels: {}
                  ## @param controller.podAnnotations Extra annotations for Kafka pods
                  ## ref: https://kubernetes.io/docs/concepts/overview/working-with-objects/annotations/
                  ##
                  podAnnotations: {}
                  ## @param controller.podAffinityPreset Pod affinity preset. Ignored if `affinity` is set. Allowed values: `soft` or `hard`
                  ## ref: https://kubernetes.io/docs/concepts/scheduling-eviction/assign-pod-node/#inter-pod-affinity-and-anti-affinity
                  ##
                  podAffinityPreset: ""
                  ## @param controller.podAntiAffinityPreset Pod anti-affinity preset. Ignored if `affinity` is set. Allowed values: `soft` or `hard`
                  ## Ref: https://kubernetes.io/docs/concepts/scheduling-eviction/assign-pod-node/#inter-pod-affinity-and-anti-affinity
                  ##
                  podAntiAffinityPreset: soft
                  ## Node affinity preset
                  ## Ref: https://kubernetes.io/docs/concepts/scheduling-eviction/assign-pod-node/#node-affinity
                  ##
                  nodeAffinityPreset:
                    ## @param controller.nodeAffinityPreset.type Node affinity preset type. Ignored if `affinity` is set. Allowed values: `soft` or `hard`
                    ##
                    type: ""
                    ## @param controller.nodeAffinityPreset.key Node label key to match Ignored if `affinity` is set.
                    ## E.g.
                    ## key: "kubernetes.io/e2e-az-name"
                    ##
                    key: ""
                    ## @param controller.nodeAffinityPreset.values Node label values to match. Ignored if `affinity` is set.
                    ## E.g.
                    ## values:
                    ##   - e2e-az1
                    ##   - e2e-az2
                    ##
                    values: []
                  ## @param controller.affinity Affinity for pod assignment
                  ## Ref: https://kubernetes.io/docs/concepts/configuration/assign-pod-node/#affinity-and-anti-affinity
                  ## Note: podAffinityPreset, podAntiAffinityPreset, and  nodeAffinityPreset will be ignored when it's set
                  ##
                  affinity: {}
                  ## @param controller.nodeSelector Node labels for pod assignment
                  ## Ref: https://kubernetes.io/docs/concepts/scheduling-eviction/assign-pod-node/
                  ##
                  nodeSelector: {}
                  ## @param controller.tolerations Tolerations for pod assignment
                  ## Ref: https://kubernetes.io/docs/concepts/configuration/taint-and-toleration/
                  ##
                  tolerations: []
                  ## @param controller.topologySpreadConstraints Topology Spread Constraints for pod assignment spread across your cluster among failure-domains. Evaluated as a template
                  ## Ref: https://kubernetes.io/docs/concepts/workloads/pods/pod-topology-spread-constraints/#spread-constraints-for-pods
                  ##
                  topologySpreadConstraints: []
                  ## @param controller.terminationGracePeriodSeconds Seconds the pod needs to gracefully terminate
                  ## ref: https://kubernetes.io/docs/concepts/containers/container-lifecycle-hooks/#hook-handler-execution
                  ##
                  terminationGracePeriodSeconds: ""
                  ## @param controller.podManagementPolicy StatefulSet controller supports relax its ordering guarantees while preserving its uniqueness and identity guarantees. There are two valid pod management policies: OrderedReady and Parallel
                  ## ref: https://kubernetes.io/docs/tutorials/stateful-application/basic-stateful-set/#pod-management-policy
                  ##
                  podManagementPolicy: Parallel
                  ## @param controller.minReadySeconds How many seconds a pod needs to be ready before killing the next, during update
                  ##
                  minReadySeconds: 0
                  ## @param controller.priorityClassName Name of the existing priority class to be used by kafka pods
                  ## Ref: https://kubernetes.io/docs/concepts/configuration/pod-priority-preemption/
                  ##
                  priorityClassName: ""
                  ## @param controller.runtimeClassName Name of the runtime class to be used by pod(s)
                  ## ref: https://kubernetes.io/docs/concepts/containers/runtime-class/
                  ##
                  runtimeClassName: ""
                  ## @param controller.enableServiceLinks Whether information about services should be injected into pod's environment variable
                  ## The environment variables injected by service links are not used, but can lead to slow kafka boot times or slow running of the scripts when there are many services in the current namespace.
                  ## If you experience slow pod startups or slow running of the scripts you probably want to set this to `false`.
                  ##
                  enableServiceLinks: true
                  ## @param controller.schedulerName Name of the k8s scheduler (other than default)
                  ## ref: https://kubernetes.io/docs/tasks/administer-cluster/configure-multiple-schedulers/
                  ##
                  schedulerName: ""
                  ## @param controller.updateStrategy.type Kafka statefulset strategy type
                  ## ref: https://kubernetes.io/docs/concepts/workloads/controllers/statefulset/#update-strategies
                  ##
                  updateStrategy:
                    type: RollingUpdate
                  ## @param controller.extraVolumes Optionally specify extra list of additional volumes for the Kafka pod(s)
                  ## e.g:
                  ## extraVolumes:
                  ##   - name: kafka-jaas
                  ##     secret:
                  ##       secretName: kafka-jaas
                  ##
                  extraVolumes: []
                  ## @param controller.extraVolumeMounts Optionally specify extra list of additional volumeMounts for the Kafka container(s)
                  ## extraVolumeMounts:
                  ##   - name: kafka-jaas
                  ##     mountPath: /bitnami/kafka/config/kafka_jaas.conf
                  ##     subPath: kafka_jaas.conf
                  ##
                  extraVolumeMounts: []
                  ## @param controller.sidecars Add additional sidecar containers to the Kafka pod(s)
                  ## e.g:
                  ## sidecars:
                  ##   - name: your-image-name
                  ##     image: your-image
                  ##     imagePullPolicy: Always
                  ##     ports:
                  ##       - name: portname
                  ##         containerPort: 1234
                  ##
                  sidecars: []
                  ## @param controller.initContainers Add additional Add init containers to the Kafka pod(s)
                  ## e.g:
                  ## initContainers:
                  ##   - name: your-image-name
                  ##     image: your-image
                  ##     imagePullPolicy: Always
                  ##     ports:
                  ##       - name: portname
                  ##         containerPort: 1234
                  ##
                  initContainers: []
                  ## @section Experimental: Kafka Controller Autoscaling configuration
                  ## ref: https://kubernetes.io/docs/tasks/run-application/horizontal-pod-autoscale/
                  ##
                  autoscaling:
                    vpa:
                      ## @param controller.autoscaling.vpa.enabled Enable VPA
                      ##
                      enabled: false
                      ## @param controller.autoscaling.vpa.annotations Annotations for VPA resource
                      ##
                      annotations: {}
                      ## @param controller.autoscaling.vpa.controlledResources VPA List of resources that the vertical pod autoscaler can control. Defaults to cpu and memory
                      ##
                      controlledResources: []
                      ## @param controller.autoscaling.vpa.maxAllowed VPA Max allowed resources for the pod
                      ## cpu: 200m
                      ## memory: 100Mi
                      maxAllowed: {}
                      ## @param controller.autoscaling.vpa.minAllowed VPA Min allowed resources for the pod
                      ## cpu: 200m
                      ## memory: 100Mi
                      minAllowed: {}
                      updatePolicy:
                        ## @param controller.autoscaling.vpa.updatePolicy.updateMode Autoscaling update policy Specifies whether recommended updates are applied when a Pod is started and whether recommended updates are applied during the life of a Pod
                        ## Possible values are "Off", "Initial", "Recreate", and "Auto".
                        ##
                        updateMode: Auto
                    hpa:
                      ## @param controller.autoscaling.hpa.enabled Enable HPA for Kafka Controller
                      ##
                      enabled: false
                      ## @param controller.autoscaling.hpa.minReplicas Minimum number of Kafka Controller replicas
                      ##
                      minReplicas: ""
                      ## @param controller.autoscaling.hpa.maxReplicas Maximum number of Kafka Controller replicas
                      ##
                      maxReplicas: ""
                      ## @param controller.autoscaling.hpa.targetCPU Target CPU utilization percentage
                      ##
                      targetCPU: ""
                      ## @param controller.autoscaling.hpa.targetMemory Target Memory utilization percentage
                      ##
                      targetMemory: ""
                  ## Kafka Pod Disruption Budget
                  ## ref: https://kubernetes.io/docs/concepts/workloads/pods/disruptions/
                  ## @param controller.pdb.create Deploy a pdb object for the Kafka pod
                  ## @param controller.pdb.minAvailable Minimum number/percentage of available Kafka replicas
                  ## @param controller.pdb.maxUnavailable Maximum number/percentage of unavailable Kafka replicas
                  ##
                  pdb:
                    create: true
                    minAvailable: ""
                    maxUnavailable: ""
                  ## Enable persistence using Persistent Volume Claims
                  ## ref: https://kubernetes.io/docs/concepts/storage/persistent-volumes/
                  ##
                  persistence:
                    ## @param controller.persistence.enabled Enable Kafka data persistence using PVC, note that ZooKeeper persistence is unaffected
                    ##
                    enabled: true
                    ## @param controller.persistence.existingClaim A manually managed Persistent Volume and Claim
                    ## If defined, PVC must be created manually before volume will be bound
                    ## The value is evaluated as a template
                    ##
                    existingClaim: ""
                    ## @param controller.persistence.storageClass PVC Storage Class for Kafka data volume
                    ## If defined, storageClassName: <storageClass>
                    ## If set to "-", storageClassName: "", which disables dynamic provisioning
                    ## If undefined (the default) or set to null, no storageClassName spec is
                    ## set, choosing the default provisioner.
                    ##
                    storageClass: ""
                    ## @param controller.persistence.accessModes Persistent Volume Access Modes
                    ##
                    accessModes:
                      - ReadWriteOnce
                    ## @param controller.persistence.size PVC Storage Request for Kafka data volume
                    ##
                    size: 8Gi
                    ## @param controller.persistence.annotations Annotations for the PVC
                    ##
                    annotations: {}
                    ## @param controller.persistence.labels Labels for the PVC
                    ##
                    labels: {}
                    ## @param controller.persistence.selector Selector to match an existing Persistent Volume for Kafka data PVC. If set, the PVC can't have a PV dynamically provisioned for it
                    ## selector:
                    ##   matchLabels:
                    ##     app: my-app
                    ##
                    selector: {}
                    ## @param controller.persistence.mountPath Mount path of the Kafka data volume
                    ##
                    
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.